app/models/notice.rb

  scope :unread, lambda { |user| {:conditions => ['notices.id not in (?)', user.notices.map(&:id)]} unless user.notices.empty?}
---
SELECT "NOTICES".* FROM "NOTICES" INNER JOIN "READNOTICES" ON "NOTICES"."ID" = "READNOTICES"."NOTICE_ID" WHERE "READNOTICES"."USER_ID" = 10000
SELECT COUNT(*) FROM "NOTICES" INNER JOIN "READNOTICES" ON "NOTICES"."ID" = "READNOTICES"."NOTICE_ID" WHERE "READNOTICES"."USER_ID" = 10000