app/models/user.rb

SELECT  "DICTS".* FROM "DICTS"  WHERE "DICTS"."DICT_TYPE" = 'UserBase.status' AND "DICTS"."CODE" = 1 AND ROWNUM <= 1
---
  scope :valid_user, where(:status => Dict.find_by_dict_type_and_code("UserBase.status", 1) )